#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

stdout:
module.satire_bot.heroku_app.satire_bot: Refreshing state... [id=7e60720e-8192-4576-893c-25f2000da1c6]
module.satire_bot.heroku_build.satire_bot: Refreshing state... [id=19944e81-dbce-49b4-b5f8-7a420abf79d2]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.satire_bot.heroku_build.satire_bot has changed
  ~ resource "heroku_build" "satire_bot" {
        id                = "19944e81-dbce-49b4-b5f8-7a420abf79d2"
      ~ output_stream_url = "https://build-output.heroku.com/streams/7e/7e60720e-8192-4576-893c-25f2000da1c6/logs/19/19944e81-dbce-49b4-b5f8-7a420abf79d2.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220402%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220402T205601Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=74881be816970c3e4f5b882d3aa79a450c3b4a699ce9d6b769fc09b663748974" -> "https://build-output.heroku.com/streams/7e/7e60720e-8192-4576-893c-25f2000da1c6/logs/19/19944e81-dbce-49b4-b5f8-7a420abf79d2.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220403%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220403T024239Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=3aa9760a6fe5c24f311191f609cce67395b3ad754d2b993ea0de107763839e7a"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.satire_bot.aws_iam_role.assume_role will be created
  + resource "aws_iam_role" "assume_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.satire_bot.aws_lambda_function.ping_pong will be created
  + resource "aws_lambda_function" "ping_pong" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "bazel-bin/satire-bot/ping_pong_handler.zip"
      + function_name                  = "ping_pong"
      + handler                        = "ping_pong"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SATBOT_DISCORD_TOKEN" = ""
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.satire_bot.heroku_app.satire_bot will be updated in-place
  ~ resource "heroku_app" "satire_bot" {
        id                    = "7e60720e-8192-4576-893c-25f2000da1c6"
        name                  = "satire-bot"
      ~ sensitive_config_vars = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.satire_bot.heroku_build.satire_bot must be replaced
-/+ resource "heroku_build" "satire_bot" {
      ~ buildpacks        = [
          - "https://buildpack-registry.s3.amazonaws.com/buildpacks/heroku/go.tgz",
        ] -> (known after apply)
      ~ id                = "19944e81-dbce-49b4-b5f8-7a420abf79d2" -> (known after apply)
      ~ local_checksum    = "SHA256:e107b8d50c34ba92945b120ddff580a09dd2ef1cdbb2923d5f7b61829954eda6" -> "SHA256:60c1c06e438b90f3a628686e53679f654233eddaea15f646f3381c62b8b90274" # forces replacement
      ~ output_stream_url = "https://build-output.heroku.com/streams/7e/7e60720e-8192-4576-893c-25f2000da1c6/logs/19/19944e81-dbce-49b4-b5f8-7a420abf79d2.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220403%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220403T024239Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=3aa9760a6fe5c24f311191f609cce67395b3ad754d2b993ea0de107763839e7a" -> (known after apply)
      ~ release_id        = "a927d85d-c88e-4907-a866-71d54eb21b95" -> (known after apply)
      ~ slug_id           = "b4d0dbb7-0c13-4713-92ac-78d3b15085f6" -> (known after apply)
      ~ stack             = "heroku-20" -> (known after apply)
      ~ status            = "succeeded" -> (known after apply)
      ~ user              = [
          - {
              - email = "lucasyharada@gmail.com"
              - id    = "a3800f25-eaa7-417d-9b9d-5f3b7953685e"
            },
        ] -> (known after apply)
      ~ uuid              = "19944e81-dbce-49b4-b5f8-7a420abf79d2" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ source {
          + checksum = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

stderr:

```

</details>

*Pusher: @Adarah, Action: `pull_request`, Working Directory: `infrastructure`, Workflow: `Verify`*